7767517
101 112
Input            input_1                  0 1 input_1
Convolution      262                      1 1 input_1 262 0=64 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=1728
ReLU             264                      1 1 262 264
Convolution      265                      1 1 264 265 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
ReLU             267                      1 1 265 267
Convolution      268                      1 1 267 268 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=8192
ReLU             270                      1 1 268 270
ConvolutionDepthWise 271                      1 1 270 271 0=128 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
ReLU             273                      1 1 271 273
Convolution      274                      1 1 273 274 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=8192
Split            splitncnn_0              1 2 274 274_splitncnn_0 274_splitncnn_1
Convolution      276                      1 1 274_splitncnn_1 276 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=8192
ReLU             278                      1 1 276 278
ConvolutionDepthWise 279                      1 1 278 279 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
ReLU             281                      1 1 279 281
Convolution      282                      1 1 281 282 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=8192
BinaryOp         284                      2 1 274_splitncnn_0 282 284 0=0
Split            splitncnn_1              1 2 284 284_splitncnn_0 284_splitncnn_1
Convolution      285                      1 1 284_splitncnn_1 285 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=8192
ReLU             287                      1 1 285 287
ConvolutionDepthWise 288                      1 1 287 288 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
ReLU             290                      1 1 288 290
Convolution      291                      1 1 290 291 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=8192
BinaryOp         293                      2 1 284_splitncnn_0 291 293 0=0
Split            splitncnn_2              1 2 293 293_splitncnn_0 293_splitncnn_1
Convolution      294                      1 1 293_splitncnn_1 294 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=8192
ReLU             296                      1 1 294 296
ConvolutionDepthWise 297                      1 1 296 297 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
ReLU             299                      1 1 297 299
Convolution      300                      1 1 299 300 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=8192
BinaryOp         302                      2 1 293_splitncnn_0 300 302 0=0
Split            splitncnn_3              1 2 302 302_splitncnn_0 302_splitncnn_1
Convolution      303                      1 1 302_splitncnn_1 303 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=8192
ReLU             305                      1 1 303 305
ConvolutionDepthWise 306                      1 1 305 306 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
ReLU             308                      1 1 306 308
Convolution      309                      1 1 308 309 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=8192
BinaryOp         output_1                 2 1 302_splitncnn_0 309 output_1 0=0
Convolution      312                      1 1 output_1 312 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=8192
ReLU             314                      1 1 312 314
ConvolutionDepthWise 315                      1 1 314 315 0=128 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
ReLU             317                      1 1 315 317
Convolution      318                      1 1 317 318 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
Convolution      320                      1 1 318 320 0=512 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
ReLU             322                      1 1 320 322
ConvolutionDepthWise 323                      1 1 322 323 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=4608 7=512
ReLU             325                      1 1 323 325
Convolution      326                      1 1 325 326 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
Split            splitncnn_4              1 2 326 326_splitncnn_0 326_splitncnn_1
Convolution      328                      1 1 326_splitncnn_1 328 0=512 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
ReLU             330                      1 1 328 330
ConvolutionDepthWise 331                      1 1 330 331 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=4608 7=512
ReLU             333                      1 1 331 333
Convolution      334                      1 1 333 334 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
BinaryOp         336                      2 1 326_splitncnn_0 334 336 0=0
Split            splitncnn_5              1 2 336 336_splitncnn_0 336_splitncnn_1
Convolution      337                      1 1 336_splitncnn_1 337 0=512 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
ReLU             339                      1 1 337 339
ConvolutionDepthWise 340                      1 1 339 340 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=4608 7=512
ReLU             342                      1 1 340 342
Convolution      343                      1 1 342 343 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
BinaryOp         345                      2 1 336_splitncnn_0 343 345 0=0
Split            splitncnn_6              1 2 345 345_splitncnn_0 345_splitncnn_1
Convolution      346                      1 1 345_splitncnn_1 346 0=512 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
ReLU             348                      1 1 346 348
ConvolutionDepthWise 349                      1 1 348 349 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=4608 7=512
ReLU             351                      1 1 349 351
Convolution      352                      1 1 351 352 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
BinaryOp         354                      2 1 345_splitncnn_0 352 354 0=0
Split            splitncnn_7              1 2 354 354_splitncnn_0 354_splitncnn_1
Convolution      355                      1 1 354_splitncnn_1 355 0=512 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
ReLU             357                      1 1 355 357
ConvolutionDepthWise 358                      1 1 357 358 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=4608 7=512
ReLU             360                      1 1 358 360
Convolution      361                      1 1 360 361 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
BinaryOp         363                      2 1 354_splitncnn_0 361 363 0=0
Split            splitncnn_8              1 2 363 363_splitncnn_0 363_splitncnn_1
Convolution      364                      1 1 363_splitncnn_1 364 0=512 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
ReLU             366                      1 1 364 366
ConvolutionDepthWise 367                      1 1 366 367 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=4608 7=512
ReLU             369                      1 1 367 369
Convolution      370                      1 1 369 370 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
BinaryOp         372                      2 1 363_splitncnn_0 370 372 0=0
Convolution      373                      1 1 372 373 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32768
ReLU             375                      1 1 373 375
ConvolutionDepthWise 376                      1 1 375 376 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304 7=256
ReLU             378                      1 1 376 378
Convolution      379                      1 1 378 379 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
Split            splitncnn_9              1 2 379 379_splitncnn_0 379_splitncnn_1
Pooling          382                      1 1 379_splitncnn_1 382 0=1 1=14 11=14 2=14 12=14 3=0 13=0 14=0 15=0 5=1 6=0
Reshape          390                      1 1 382 390 0=-1
Convolution      391                      1 1 379_splitncnn_0 391 0=32 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=4608
ReLU             393                      1 1 391 393
Split            splitncnn_10             1 2 393 393_splitncnn_0 393_splitncnn_1
Pooling          395                      1 1 393_splitncnn_1 395 0=1 1=7 11=7 2=7 12=7 3=0 13=0 14=0 15=0 5=1 6=0
Reshape          403                      1 1 395 403 0=-1
Convolution      404                      1 1 393_splitncnn_0 404 0=128 1=7 11=7 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=200704
ReLU             405                      1 1 404 405
Reshape          413                      1 1 405 413 0=-1
Concat           414                      3 1 390 403 413 414 0=0
InnerProduct     415                      1 1 414 415 0=196 1=1 2=34496
